# <span style="color:black">Imports of libraries</span>

In [1]:
import pandas as pd
import numpy as np

# <span style="color:black">Creation fo series</span>

In [ ]:
s1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
s2 = pd.Series([10, 20, 30], index=['A', 'B', 'D'])
print (f"s1 is : \n{s1}\n")
print (f"s2 is : \n{s2}\n")

# + Operator

In [34]:
result = s1 + s2

In [35]:
result

A      NaN
B    131.0
C    102.0
D    135.0
E      NaN
F      NaN
S      NaN
dtype: float64

# <span style="color:black">From dictionary</span>

In [36]:
s3 = pd.Series({'avi' : '054432','shon' : '054367' , 'ron' : "055467"})
print(s3)
people = pd.DataFrame(s3)

avi     054432
shon    054367
ron     055467
dtype: object

In [37]:
people

           0
avi   054432
shon  054367
ron   055467

# From list and tuple

In [38]:
names = ['avi','shon' , 'ron']
phone_num = ('054432','054367' ,"055467")
s4 = pd.Series(phone_num , index = names)
print(s4)
people2 = pd.DataFrame(s4)

avi     054432
shon    054367
ron     055467
dtype: object

In [39]:
people2

           0
avi   054432
shon  054367
ron   055467

## From biger dict

In [41]:
my_data = {'Country': ['Israel','US','Israel','Israel'] ,'City' : ['jerusalem','Washington', 'Tel Aviv','Ashdod'] ,'Count': [100,2000,120,50]}

In [42]:
my_df = pd.DataFrame(my_data)

In [43]:
my_df

  Country        City  Count
0  Israel   jerusalem    100
1      US  Washington   2000
2  Israel    Tel Aviv    120
3  Israel      Ashdod     50

# '+' operator between 1-dim random arrays

In [11]:
my_range = (1,101)
my_size = (5)
a  =  np.random.randint(my_range[0],my_range[1],size=my_size)
b  = np.random.randint(my_range[0],my_range[1],size=my_size)

print(a)
print(b)

s1 = pd.Series(data = a, index = ['C', 'B', 'A', 'D','S'])
s2 = pd.Series(data = b, index=['F', 'C', 'D', 'E','B'])
result = s1+s2
print(result)
print(result.shape)
print(result.hasnans)

[ 2 33 71 80 47]
[ 65 100  55  97  98]
A      NaN
B    131.0
C    102.0
D    135.0
E      NaN
F      NaN
S      NaN
dtype: float64
(7,)
True

In [45]:
my_range = (1,101)
my_size = (3)
a  =  np.random.randint(my_range[0],my_range[1],size=my_size)
df = pd.DataFrame([list(a),list(a)], columns=list(range(my_size)) , index= list(range(my_size-1)))

In [13]:
df

   0   1   2
0  4  18  90
1  4  18  90

# Data frame from full dict

In [14]:
Employees = {
    'ID' : [12,22,32,24],
    'Name' : ['avi','shon' , 'ron','Yoni'] ,
    'Age' : [22,24,18,19],
    'City' : ['ashdod','ashdod','ashdod','ashdod']
}
emp_df = pd.DataFrame(Employees)

In [15]:
emp_df

   ID  Name  Age    City
0  12   avi   22  ashdod
1  22  shon   24  ashdod
2  32   ron   18  ashdod
3  24  Yoni   19  ashdod

In [16]:
emp_df_indexed = pd.DataFrame(Employees, index=Employees['ID'])

In [17]:
emp_df_indexed

    ID  Name  Age    City
12  12   avi   22  ashdod
22  22  shon   24  ashdod
32  32   ron   18  ashdod
24  24  Yoni   19  ashdod

In [18]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [19]:
df = pd.DataFrame(columns = [k for k in Employees])
new_emp1 ={ 'ID' : 1,'Name' : 'Aharon' ,'Age' : 19,'City' : 'ashdod'}
new_emp2 ={ 'ID' : 2,'Name' : 'Aharona' ,'Age' : 10,'City' : 'ashdod'}
new_emp3 ={ 'ID' : 3,'Name' : 'ron' ,'Age' : 24,'City' : 'ashdod'}
emps = [new_emp1,new_emp2,new_emp3]
print(df)
for i in range(len(emps)):
    df.loc[i] = [ val for val in emps[i].values()]

Empty DataFrame
Columns: [ID, Name, Age, City]
Index: []

In [20]:
df

   ID     Name  Age    City
0   1   Aharon   19  ashdod
1   2  Aharona   10  ashdod
2   3      ron   24  ashdod

In [21]:
test_age =18
res = df['Age']>test_age
print(type(res))

<class 'pandas.core.series.Series'>

In [22]:
res

0     True
1    False
2     True
Name: Age, dtype: bool

In [23]:
print(df[res])

   ID    Name  Age    City
0   1  Aharon   19  ashdod
2   3     ron   24  ashdod

In [24]:
df['Code'] = df['Name']+df['City']

In [25]:
df

   ID     Name  Age    City           Code
0   1   Aharon   19  ashdod   Aharonashdod
1   2  Aharona   10  ashdod  Aharonaashdod
2   3      ron   24  ashdod      ronashdod

# drop the id==0 row

In [26]:
df.drop(0 ,axis=0 , inplace=True)

In [27]:
df

   ID     Name  Age    City           Code
1   2  Aharona   10  ashdod  Aharonaashdod
2   3      ron   24  ashdod      ronashdod

# drop the 'Code'==0 column

In [28]:
df.drop('Code' ,axis='columns' , inplace=True)

In [29]:
df

   ID     Name  Age    City
1   2  Aharona   10  ashdod
2   3      ron   24  ashdod

In [30]:
def birthday( age : int) :
    print ('Happy birtday')
    return age+1

In [31]:
df['Age'].apply(lambda x : x+1).equals(df['Age'].apply(birthday))

Happy birtday
Happy birtday

True

In [32]:
df['Age'] = df['Age'].apply(birthday)

Happy birtday
Happy birtday

In [33]:
df

   ID     Name  Age    City
1   2  Aharona   11  ashdod
2   3      ron   25  ashdod